export const badWords = ["отпиздить", "пізда", "блять", "хуйло"];
export const joinWords = [
  "запрошувальн",
  "покидає групу",
  "приєднується до групи",
];

// А

// А я ебу (фраз.) – а я знаю (розумію)

// Б

// Без пиздежа – без підступу, всерйоз

// Без пизды – без обману

// Бля – вигук, що виражає будь-яке почуття з яким завгодно
// відтінком

// Бля буду (фраз.) – клятвена обіцянка

// Блядина – 1) жінка легкого поводження; 2) погана людина

// Блядистка – розпусна жінка

// Блядища – див. Блядина

// Блядки – 1) гулянка; 2) спроба познайомитися з особами протилежної
// статі

// Блядовать – вступати в неодноразові статеві відносини, часто з
// різними партнерами

// Блядовитый – людина, що багато і з задоволенням блядует

// Блядовозка – автомобіль, в якому зазвичай відбуваються неодноразові
// статеві акти

// Блядский – 1) див. Блядовитый; 2) поганий; 3) розпусний

// Блядство – 1) юрба блядей; 2) статеві відносини; 3) що-небудь
// погане

// Блядствовать – див. Блядовать

// Блядун – див. Блядовитый

// Блядь – 1) див. Блядина; 2) вставне слово; 3) стан; 4)
// вираження невдоволення

// Блядюга – див. Блядь(1), причому дуже страшна

// Блядюган – неприємна людина

// Бляха муха (фраз.) – див. Блядь(4)

// В

// В ахуе – бути шокованим

// Вздрючить(варіант – вздрочить) – 1) див. Выебать(3); 2) див. Взъебать(2)

// Взъебать – 1) зробити догану; 2) див. Въебать(1)

// Вот блядь! (фраз.) – див. Блядь(4)

// В пизду (фраз.) – 1) йти в пизду – відсилати обридлу людину; 2) непотрібність

// Въебать – 1) ударити; 2) випити спиртних напоїв

// Выблядок – дитина, часто незаконнонароджена

// Выебанный – людина, яку выебали

// Выебать – 1) вступити в статеві відносини; 2) зробити що-небудь (выебать на іспиті); 3) виявитися сильніше в чому-небудь (выебать у шахи)

// Выебины – виямок

// Выебнуться – випендритися

// Выебоны – понти

// Выебосы – див. Выебоны

// Выёбисто – круто

// Выёбистый – 1) чоловік, що до всіх пристає; 2) крутий

// Выёбываться – випендрюватися

// Г

// Глухуеватый – глухий

// Говно – 1) погана людина; 2) стан справ; 3) щось легке, нескладне(говно питання); 4) несмачна їжа

// Говнюк – див. Говно(1)

// Гондон – 1) презерватив; 2) погана людина

// Д

// Доёбывать(ся) – 1) діставати; 2) замучити; 3) доробляти

// Долбоёб – 1) погана людина; 2) надокучливий; 3) тупий, нетямущий

// Допиздеться – 1) договоритися

// До пизды (фраз.) – все одно

// До святого проеба (фраз.) – дуже довго, майже нескінченно

// До хуя (фраз.) – багато

// Дрочилка – 1) чоловік, що дрочит; 2) статевий орган,
// переважно чоловічий

// Дрочить(ся) – 1) мастурбувати; 2) робити нудну, одноманітну роботу

// Дрочун – див. Дрочилка(1)

// Е

// Ебала жаба гадюку (фраз.) – див. Пиздец

// Ебало – обличчя

// Ебальник – див. Ебало

// Ебандей – 1) весела людина, приколіст (часто – з негативним відтінком); 2) нехлюй

// Ебанутый – ненормальний

// Ебануть – вдарити (ебануть током)

// Ебануться – 1) впасти, вдаритися; 2) збожеволіти ; 3) здивуватися, обуритися і т. ін.

// Ебать – 1) вступати в статеві відносини; 2) приставати, задавати багато питань; 3) вигук, що означає “багато”; 4) вигук, що означає подив, замилування і т. ін.

// Ебать-ебать (фраз.) – означає складність, подив і інші різноманітні емоції

// Ебать-копать (фраз.) – див. Ебать-ебать

// Ебаться – 1) бути в статевих відносинах; 2) див. Дрочиться(2)

// Ебать ту Люську (фраз.) – див. Ебать-ебать

// Ебать-тарахтеть – див. Ебать-ебать

// Ебеныть! – вигук

// Ебиздить – один з синонімів Ебать

// Ебись ты злоебучим проебом! –найстрашніша лайка Макса Галочки, що має означати приблизно таке “Щоб тобі усе твоє життя аж до самої смерті було дуже-дуже погано!”

// Ебическая (сила) ! (фраз.) – 1) означає невдоволення

// Еблысь – див. Хуяк

// Ебля – див. Блядство(2)

// Ебловать – те ж, що й Еблом торговать

// Еблом торговать (фраз.) – знаходитися в прострації, ні на що не реагувати; байдикувати

// Ебстись – те саме, що й Ебаться

// Ебуня (бігти, лізти -//-) – 1) чагарник, кущі; 2) обхідні дороги, місця, шляхи

// Ебучий – той, який дістав

// Ё
// Ёбан(н)ый в рот (фраз.) – 1) невгодна людина; 2) яке-небудь почуття взагалі

// Ёбарь – 1) див. Блядун; 2) той, хто знаходиться в статевих відносинах (наприклад, її Ё.)

// Ёби-ёби – 1) статевий акт; 2) що-небудь погане (наприклад, зробити їм Ё.)

// Ёбнутый – див. Ебанутый

// Ёбнуться – див. Ебануться

// Ёбом токнуть (перекручене током ёбнуть) – не в порядку (наприклад, Ти що, Ё.?)

// Ёб твою мать (фраз.) – виражає яке завгодно почуття

// Ж
// Жопа – 1) кінець чого-небудь (наприклад, Ж. прийшла); 2) неспритна,
// дурнувата людина, тюхтій

// З
// Заебать – замучити

// Заебаться – замучитися

// Заебись – вищий ступінь чого-небудь

// Заёб – 1) що-небудь дивне, дивовижне; 2) хоббі, захоплення

// Заёбанный – замучений

// Залупа – 1) крайня плоть чоловічого статевого члена; 2) погана людина; 3) жаднюга

// Залупиться – 1) поскупитися; 2) вз’їстися на кого-небудь

// Запиздячить – 1) зробити; 2) всунути; 3) побити

// Захуярить – 1) з’їсти; 2) побити

// Злоебучий – див. Ебучий, але набагато гірше

// Злопидар – негарна, погана людина

// К
// Какого хуя? – навіщо?

// Как хуем – як вітром (К. х. здуло)

// К ебеням – див. В пизду(2)

// Клара Целкин – незаймана за переконаннями

// Колдоёбины – див. Выебины

// Кончать – еякулювати

// Конченный – 1) недорозвинений; 2) втрачений

// Курва – див. Блядь(1)

// Л
// Лярва – див. Блядь(1)

// М
// Мозги ебать (фраз.) – набридати

// Мозгоёб – див. Долбоёб(2)

// Мудак – погана людина

// Мудило – див. Мудак

// Мудозвон – 1) див. Мудак; 2) чоловік,що багато і даремно говорить

// Мудопоёбище – 1) міфічна тварина, що збереглася лише в наскальних (точніше, напартних) гравюрах

// Н
// Наебать – обдурити

// Наебнуть – 1) з’їсти; 2) випити; 3) ударити

// Наёбка – обман

// Наёбник – лопата совкова

// Наперепиздяй – 1) напролом; 2) напереріз

// Напидарасить ботинки – начистити ботинки ваксою або кремом

// Напиздеть – 1) розповісти; 2) збрехати

// Нахуй – 1) навіщо; 2) слово – зв’язка;3) куди-небудь, взагалі

// Нахуя? – навіщо?

// Нахуяриться – 1) наїстися; 2) напитися

// Невъебезно – багато

// Не ебите мне мозги (фраз.) – 1) відстаньте; 2) не морочте мені голову

// Нездоровая хуйня – що-небудь погане

// Не пиздеть была команда (фраз.) – мовчати!

// Нехуёвый – непоганий, хороший

// Нехуй – нічого (Н. робити)

// Ни в пизду, ни в Красную Армию (фраз.) – 1) нікуди не придатна людина; 2) ні на що не придатна річ

// Ни с хуя (фраз.) – ні з того, ні з цього

// О
// Объебать –обманути

// Однохуйственный – 1) схожий, подібний; 2) однаковий, такий самий

// Опизденение – стан подиву, жаху і т. ін.

// Остоебенить – набриднути

// Остоебеть – див. Остоебенить

// Отпиздить – побити

// Отпиздохать – див. Отпиздить

// Отхуярить – див. Отпиздить

// Отъебать – 1) див. Отпиздить; 2) див. Выебать(2),(3)

// Отъебаться – відстати

// Охуение – див. Опизденение

// Охуенно – добре, гарно

// Охуенный – 1) гарний, класний; 2) цікавий

// Охуеть – 1) прийти в захват; 2) вигук: от так от!; 3) бути шокованим; 4) знахабніти

// Охуйный – див. Охуенный

// П
// Педрило – зневажливе звертання до людини(Ти, педріло, а ну-ка дай,
// відкрий – Л. Подерв’янський)

// Переебать – вдарити

// Пидар – 1) гомосексуаліст; 2) погана людина

// Пидарас – див. Пидар

// Пидарасить – виконувати важку, брудну роботу

// Пидарастический – 1) поганий; 2) складний, важкий

// Пизда – 1) жіночий статевий орган; 2) погана жінка (іноді – і чоловік); 3) див. Жопа(1); 4) погана, незначна людина

// Пизданутый – 1) вкрадений; 2) тупий

// Пиздануть – 1) вкрасти; 2) вдарити

// Пиздарики – кінець чого-небудь, чому-небудь

// Пизда рулям (фраз.) – 1) кінець; 2) кінець усьому

// Пиздатый – див. Охуенный(1)

// Пиздень – див. Пизда(1)

// Пиздеть – 1) багато говорити; 2) брехати

// Пиздец – 1) кінець чого-небудь; 2) вигук, що означає вираження будь-якого почуття

// Пиздец на холодец (фраз.) – див. Пиздец(1),(2)

// Пиздец подкрался незаметно (фраз.) – див. Пиздец(1)

// Пиздёж – 1) розмова; 2) неправда, брехня; 3) обмова, догана

// Пиздилка – бійка

// Пиздить – 1) крастися; 2) бити; 3) кидати

// Пиздиться – битися

// Пиздишь косой (фраз.) – брешеш

// Пиздливый – той, хто багато й огидно розмовляє

// Пиздоблядский – див. Блядский і Пизданутый

// Пиздобол – той, хто багато говорить

// Пиздобратия – 1) група людей, колектив; 2) братва

// Пиздоватизм – філософська система з п’єс Л. Подерв’янського

// Пиздоватый – див. Пизданутый(2)

// Пиздовать – йти

// Пиздожадность – жадібність

// Пиздозавр – швидше за все, назва одного з видів динозаврів, але, в принципі, будь-яка тварина (і людина)

// Пиздой накрыться (фраз.) – 1) закінчитися; 2) не вийти; 3) зламатися

// Пиздопротивный – 1)противний; 2) надокучливий

// Пиздотня – стан душі, швидше за все негативний

// Пиздрон (армійськ.) – 1) людина; 2) солдат строкової служби

// Пиздун – 1) людина, що багато говорить; 2) людина, що бреше

// Пиздун твоя фамилия (фраз.) – та брешеш ти все

// Пиздык – 1) облом; 2) удар; 3) падіння; 4) кінець

// Пиздыкнуться – 1) впасти; 2) вдаритися; 3) обламатися

// Пиздюк – вкрай негативна людина, що часто і багато говорить

// Пиздюлей дать (фраз.) – 1) побити; 2) вилаяти, накричати; 3) зробити догану

// Пиздюлина – 1) див. Пропиздон; 2) удар

// Пиздяч(ш)ить – 1) див. Пиздовать; 2) див. Пиздить(2)

// Поблядушка – див. Блядь(1), але в основному нешкідлива

// Подпёздывать – 1) підтакувати; 2) встрявать у розмову

// Подъёб(-ка) – 1) жарт, прикол; 2) знущання

// Подъёбщик – людина, що любить підколоти, піджартувати, познущатися

// Подъёбывать – 1) підколювати, жартувати; 2) знущатися

// Поебать – все одно

// Поебеньщик – пофігіст

// Поебень – яка-небудь річ (подія), часто негативні

// Поеботина – див. Поебень

// Попиздеть – поговорити, погорозмовляти

// Попиздить – вкрасти (на відміну від Спиздить – не одну, а багато речей)

// Попизженный – побитий

// Похуист – індиферентна людина

// Похуистический – байдужий

// Похуй – все одно

// По хую – див. Похуй

// Приебаться – пристати

// Припиздяч(ш)ить – прибити

// Припизженный – див. Попизженный

// Проблядь – синонім одного зі значень Блядь

// Проебать – 1) проґавити; 2) програти

// Проебом – див. Похуй

// Пропиздон – прочухан (уставити П.)

// Р
// Разбляду ж твою мать (фраз.) – вираження негативних емоцій

// Разъебать – 1) розколупати; 2) роздовбати

// Разъебошить – розбити

// Разъёбанный – 1) розбитий; 2) розламаний

// Распиздеть – 1) обмовитися; 2) розповісти

// Распиздеться – розкричатися

// Распиздяй – 1) нехлюй; 2) незібрана, безвідповідальна людина

// Распоебаться – розперезатися, розпуститися

// Расхуярить – див. Разъебошить

// С
// Семихуй (восьмирукий С.) – міфологічна істота, очевидно страшна

// Скосопиздить – скорчити

// Скурвиться – стати поганою людиною

// Смехуёчки – 1) сміх; 2) веселощі

// Спиздеть – збрехати

// Спиздить – вкрасти

// Сука – 1) погана людина (в основному – жіночого роду); 2) вигук

// Съебаться – 1) піти, утекти

// Съебнуть – див. Съебаться

// Т
// Триебущий – епітет до Мудопоёбище

// Тристапиздоблядоящер (хитровыебанный трахоногий Т.) – міфологічна тварина

// У
// Уебать – див. Въебать

// Уёбище (лесное) – 1) негарна, часто страшна людина; 2) погана людина

// Уёбок – погана людина

// Уёбывать – тікати

// Уёбен зи биттэ (фраз.) – йди звідси

// Упиздень – майже те ж, що й Уёбище

// Упиздить – 1) див. Спиздить; 2) див. Съебаться

// Упиздюхать – див. Съебаться

// Ухуярить – 1) вдарити; 2) випити

// Ухты – хуюхты (фраз.) – 1) подив; 2) замилування

// Ф
// Фак ю (Fuck you) – пішов ти

// Х
// Хитровыебанный – 1) хитрий; 2) проноза

// Хуева гора (фраз.) – велика кількість

// Хуеплёт – 1) брехун; 2) див. Пиздун

// Хуесос – 1) людина, що любить займатися оральным сексом; 2) погана людина

// Хуетень – 1) чортовиння; 2) прикол; 3) щось незрозуміле

// Хуеть – див. Охуеть

// Хуёвина – див. Хуйня

// Хуёво – багато

// Хуёвый – поганий

// Хуиный – див. Хуёвый

// Хуи пинать (валять) (фраз.) – нічого не робити

// Хуй – 1) чоловічий статевий орган; 2) погана людина; 3) вигук; 4) неможливість (Х. зробиш)

// Хуй его (знает) (фраз.) – не знаю

// Хуйло – див. Хуй(2)

// Хуй на! – звичайно говориться, коли співрозмовник, не розчувши питання, перепитує “А?”

// Хуй на ны! (фраз.) – 1) от тобі!; 2) немає

// Хуй на палочке – незначна людина, незначність

// Хуйнёй страдать – займатися чимось, зазвичай безглуздим

// Хуйнуть – 1) збити; 2) кинути

// Хуйня – 1) щось погане; 2) вигук; 3) яка-небудь чи річ подія

// Хуй там! (фраз.) – немає

// Хуюшки – 1) див. Хуй там!; 2) не дам

// Хуя! – див.Хуюшки

// Хуяк – вигук, що позначає удар чи падіння

// Хуярить – 1) працювати; 2) їсти, пити; 3) бити; 4) робити що-небудь; 5) йти, рухатися куди-небудь

// Хуячить – їхати, йти, летіти, взагалі пересуватися

// Ц
// Целка – 1) дівоча пліва; 2) незаймана, діва

// Целка – фанатичка – незаймана по переконаннях

// ЦПХ (центральное пиздохранилище) – 1) жіночий гуртожиток; 2) будинок, де багато жінок

// Ч
// Чмо – 1) слабка, беззахисна людина; 2) погана людина

// Чмошный – див. Чмо

// Что за нахуй? (фраз.) – що таке? хто такий?

// Ш
// Шароёбиться – 1) вбивати час; 2) блукати без діла; 3) прогулювати
