// Определяем массив
export const arrayFunnyWords = [
  "Aх ти cобача кров!",
  "Дідько б тебе взяв!",
  "Ах ти ж когут общипаний!",
  "Пан хоче мати чудову гаму кольорів на обличчі?",
  "Діждався сраної немочі.",
  "Морда — хоч пацюків бий!",
  "Стули пельку!",
  "Ах ти свиняче рило!",
  "Чого балухи вилупив?",
  "Гарна, як срака навиворіт.",
  "А щоб тебе підняло і гепнуло!",
  "Чого шкіришся? (чого смієшся?)",
  "Так ви одною сракою на два базари?",
  "Курвий сину",
  "Най би тебе наглов кров'ю залило",
  "Покажеш піцика адміну?",
  "Дай цицьку?",
  "Брови вже вискубували ?",
  "Жаре пісєц",
  "Може феліжанку кави ми запропонуєш?",
  "Немає вже сечі терпіти ці пекельні борошна",
];

// Получаем случайный ключ массива
// var rand = Math.floor(Math.random() * arr.length);

// alert(arr[rand]);
// Выведем, например: JavaScript
// export const funnyWord = arr[rand];

export function funnyWord(arr) {
  let rand = Math.floor(Math.random() * arr.length);
  return arr[rand];
}
